---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrLegendShowDescription
source: html/302673e6-9a91-ab71-747f-efe0e0dd784b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrLegendShowDescription Property

"Show Description"

## Syntax (C#)
```csharp
public static ForgeTypeId SpatialFieldMgrLegendShowDescription { get; }
```